# Programación como Herramienta para la Ingeniería 2020-2
## Ayudantía 2: Bases de datos y archivos
### Ayudante: Pablo Seisdedos (pcseisdedos@uc.cl)

## Parte I: Conociendo la base de datos
Lo primero que vamos a hacer es entender la información que viene en la base de datos, para esto realizaremos algunas consultas que nos permitirán visualizar y comprender los datos.

In [1]:
import sqlite3
import csv

Uso de **PRAGMA table_info**:

|Datos en pragma table|	Significado|
| :-: | :--------------- |
|cid	|Id de la columna.|
|name	| Nombre de la columna.|
|type| Indica el tipo de dato en dicha columna.|
|notnull	|Indica si la columna tiene una restriccion de no nulidad.|
|dflt_value	|El valor por defecto de la columna.|
|pk	|Binaria que vale 1 si la columna es PK y 0 si no.|

In [2]:
def imprime_datos(BD_name): # Se debe ejecutar con la base de datos abierta.
    sql_statement = "SELECT name FROM sqlite_master WHERE type = 'table';"
    cursor.execute(sql_statement)
    tablas = [nombre[0] for nombre in cursor.fetchall()]

    print(f"Información base de datos: {BD_name}")
    for tabla in tablas:
        print(2*'\n'+ f"Información tabla {tabla}:")
        sql_statement = "PRAGMA table_info({})".format(tabla) #cid  name  type  notnull  dflt_value  pk
        cursor.execute(sql_statement)

        for columna in cursor:
            cid, name, tipo, notnull, dflt_val, pk = *columna,
            print(f'\tInformación columna {cid} - {name}: {tipo}, {notnull}, {dflt_val}, {pk}')

In [3]:
BD_name = 'airport.db'
connection = sqlite3.connect(BD_name)
cursor = connection.cursor()
imprime_datos(BD_name)

Información base de datos: airport.db


Información tabla Flights:
	Información columna 0 - flno: INTEGER, 0, None, 0
	Información columna 1 - origin: TEXT, 0, None, 0
	Información columna 2 - destination: TEXT, 0, None, 0
	Información columna 3 - distance: INTEGER, 0, None, 0
	Información columna 4 - departs: TIME, 0, None, 0
	Información columna 5 - arrives: TIME, 0, None, 0
	Información columna 6 - price: INTEGER, 0, None, 0


Información tabla Certified:
	Información columna 0 - eid: INT, 0, None, 0
	Información columna 1 - ename: TEXT, 0, None, 0
	Información columna 2 - salary: INT, 0, None, 0
	Información columna 3 - aid: INT, 0, None, 0
	Información columna 4 - aname: TEXT, 0, None, 0
	Información columna 5 - cruisingrange: INT, 0, None, 0

In [4]:
cursor.execute("SELECT * FROM Certified")

In [5]:
cursor.fetchall()

[(242518965, 'James Smith', 120433, 2, 'Boeing 737-800', 3383),
 (242518965, 'James Smith', 120433, 10, 'Boeing 757-300', 4010),
 (141582651, 'Mary Johnson', 178345, 2, 'Boeing 737-800', 3383),
 (141582651, 'Mary Johnson', 178345, 10, 'Boeing 757-300', 4010),
 (141582651, 'Mary Johnson', 178345, 12, 'Boeing 767-400ER', 6475),
 (11564812, 'John Williams', 153972, 2, 'Boeing 737-800', 3383),
 (11564812, 'John Williams', 153972, 10, 'Boeing 757-300', 4010),
 (567354612, 'Lisa Walker', 256481, 1, 'Boeing 747-400', 8430),
 (567354612, 'Lisa Walker', 256481, 2, 'Boeing 737-800', 3383),
 (567354612, 'Lisa Walker', 256481, 3, 'Airbus A340-300', 7120),
 (567354612, 'Lisa Walker', 256481, 4, 'British Aerospace Jetstream 41', 1502),
 (567354612, 'Lisa Walker', 256481, 5, 'Embraer ERJ-145', 1530),
 (567354612, 'Lisa Walker', 256481, 7, 'Piper Archer III', 520),
 (567354612, 'Lisa Walker', 256481, 9, 'Lockheed L1011', 6900),
 (567354612, 'Lisa Walker', 256481, 10, 'Boeing 757-300', 4010),
 (567354612, 'Lisa Walker', 256481, 11, 'Boeing 777-300', 6441),
 (567354612, 'Lisa Walker', 256481, 12, 'Boeing 767-400ER', 6475),
 (567354612, 'Lisa Walker', 256481, 15, 'Boeing 727', 1504),
 (552455318, 'Larry West', 101745, 2, 'Boeing 737-800', 3383),
 (552455318, 'Larry West', 101745, 7, 'Piper Archer III', 520),
 (552455318, 'Larry West', 101745, 14, 'Airbus A319', 1805),
 (550156548, 'Karen Scott', 205187, 1, 'Boeing 747-400', 8430),
 (550156548, 'Karen Scott', 205187, 12, 'Boeing 767-400ER', 6475),
 (390487451, 'Lawrence Sperry', 212156, 3, 'Airbus A340-300', 7120),
 (390487451, 'Lawrence Sperry', 212156, 13, 'Airbus A320', 2605),
 (390487451, 'Lawrence Sperry', 212156, 14, 'Airbus A319', 1805),
 (274878974, 'Michael Miller', 99890, 10, 'Boeing 757-300', 4010),
 (274878974, 'Michael Miller', 99890, 12, 'Boeing 767-400ER', 6475),
 (254099823, 'Patricia Jones', 24450, None, None, None),
 (356187925, 'Robert Brown', 44740, 6, 'SAAB 340', 2128),
 (355548984, 'Angela Martinez', 212156, 8, 'Tupolev 154', 4103),
 (355548984, 'Angela Martinez', 212156, 9, 'Lockheed L1011', 6900),
 (310454876, 'Joseph Thompson', 212156, 8, 'Tupolev 154', 4103),
 (310454876, 'Joseph Thompson', 212156, 9, 'Lockheed L1011', 6900),
 (489456522, 'Linda Davis', 127984, None, None, None),
 (489221823, 'Richard Jackson', 23980, None, None, None),
 (548977562, 'William Ward', 84476, 7, 'Piper Archer III', 520),
 (310454877, 'Chad Stewart', 33546, None, None, None),
 (142519864, 'Betty Adams', 227489, 1, 'Boeing 747-400', 8430),
 (142519864, 'Betty Adams', 227489, 2, 'Boeing 737-800', 3383),
 (142519864, 'Betty Adams', 227489, 3, 'Airbus A340-300', 7120),
 (142519864, 'Betty Adams', 227489, 7, 'Piper Archer III', 520),
 (142519864, 'Betty Adams', 227489, 10, 'Boeing 757-300', 4010),
 (142519864, 'Betty Adams', 227489, 11, 'Boeing 777-300', 6441),
 (142519864, 'Betty Adams', 227489, 12, 'Boeing 767-400ER', 6475),
 (142519864, 'Betty Adams', 227489, 13, 'Airbus A320', 2605),
 (269734834, 'George Wright', 289950, 1, 'Boeing 747-400', 8430),
 (269734834, 'George Wright', 289950, 2, 'Boeing 737-800', 3383),
 (269734834, 'George Wright', 289950, 3, 'Airbus A340-300', 7120),
 (269734834,
  'George Wright',
  289950,
  4,
  'British Aerospace Jetstream 41',
  1502),
 (269734834, 'George Wright', 289950, 5, 'Embraer ERJ-145', 1530),
 (269734834, 'George Wright', 289950, 6, 'SAAB 340', 2128),
 (269734834, 'George Wright', 289950, 7, 'Piper Archer III', 520),
 (269734834, 'George Wright', 289950, 8, 'Tupolev 154', 4103),
 (269734834, 'George Wright', 289950, 9, 'Lockheed L1011', 6900),
 (269734834, 'George Wright', 289950, 10, 'Boeing 757-300', 4010),
 (269734834, 'George Wright', 289950, 11, 'Boeing 777-300', 6441),
 (269734834, 'George Wright', 289950, 12, 'Boeing 767-400ER', 6475),
 (269734834, 'George Wright', 289950, 13, 'Airbus A320', 2605),
 (269734834, 'George Wright', 289950, 14, 'Airbus A319', 1805),
 (269734834, 'George Wright', 289950, 15, 'Boeing 727', 1504),
 (287321212, 'Michael Miller', 48090, None, None, None),
 (552455348, 'Dorthy Lewis', 92013, None, None, None),
 (248965255, 'Barbara Wilson', 43723, None, None, None),
 (159542516, 'William Moore', 48250, 5, 'Embraer ERJ-145', 1530),
 (159542516, 'William Moore', 48250, 7, 'Piper Archer III', 520),
 (348121549, 'Haywood Kelly', 32899, None, None, None),
 (90873519, 'Elizabeth Taylor', 32021, 6, 'SAAB 340', 2128),
 (486512566, 'David Anderson', 743001, None, None, None),
 (619023588, 'Jennifer Thomas', 54921, None, None, None),
 (15645489, 'Donald King', 18050, None, None, None),
 (556784565, 'Mark Young', 205187, 2, 'Boeing 737-800', 3383),
 (556784565, 'Mark Young', 205187, 3, 'Airbus A340-300', 7120),
 (556784565, 'Mark Young', 205187, 5, 'Embraer ERJ-145', 1530),
 (573284895, 'Eric Cooper', 114323, 3, 'Airbus A340-300', 7120),
 (573284895, 'Eric Cooper', 114323, 4, 'British Aerospace Jetstream 41', 1502),
 (573284895, 'Eric Cooper', 114323, 5, 'Embraer ERJ-145', 1530),
 (574489456, 'William Jones', 105743, 6, 'SAAB 340', 2128),
 (574489456, 'William Jones', 105743, 8, 'Tupolev 154', 4103),
 (574489457, 'Milo Brooks', 20, 7, 'Piper Archer III', 520),
 (16, 'Schwitzer 2-33', 30, None, None, None)]

In [6]:
cursor.execute("SELECT * FROM Certified C WHERE C.eid = 16")
aid, aname, cruisingrange, eid, ename, salary = cursor.fetchone()
cursor.execute("DELETE FROM Certified WHERE eid = 16")
cursor.execute('INSERT INTO Certified VALUES (?,?,?,?,?,?)', [eid, ename, salary, aid, aname, cruisingrange])

In [7]:
cursor.execute("SELECT * FROM Certified")
cursor.fetchall()[-10:]

[(556784565, 'Mark Young', 205187, 2, 'Boeing 737-800', 3383),
 (556784565, 'Mark Young', 205187, 3, 'Airbus A340-300', 7120),
 (556784565, 'Mark Young', 205187, 5, 'Embraer ERJ-145', 1530),
 (573284895, 'Eric Cooper', 114323, 3, 'Airbus A340-300', 7120),
 (573284895, 'Eric Cooper', 114323, 4, 'British Aerospace Jetstream 41', 1502),
 (573284895, 'Eric Cooper', 114323, 5, 'Embraer ERJ-145', 1530),
 (574489456, 'William Jones', 105743, 6, 'SAAB 340', 2128),
 (574489456, 'William Jones', 105743, 8, 'Tupolev 154', 4103),
 (574489457, 'Milo Brooks', 20, 7, 'Piper Archer III', 520),
 (None, None, None, 16, 'Schwitzer 2-33', 30)]

In [8]:
connection.close()

## Parte II: Creación de tablas y carga de datos

In [9]:
connection = sqlite3.connect(BD_name) 
cursor = connection.cursor()

### Empleados

In [10]:
cursor.execute("CREATE TABLE IF NOT EXISTS Employees(eid INTEGER PRIMARY KEY, ename TEXT, salary INTEGER)")
cursor.execute("SELECT DISTINCT C.eid, C.ename, C.salary FROM Certified C")
for line in cursor.fetchall():
    cursor.execute('INSERT INTO Employees VALUES (?,?,?)', line)

In [11]:
cursor.execute("SELECT * FROM Employees E ORDER BY E.eid DESC")
cursor.fetchall()[:15]

[(619023588, 'Jennifer Thomas', 54921),
 (574489457, 'Milo Brooks', 20),
 (574489456, 'William Jones', 105743),
 (573284895, 'Eric Cooper', 114323),
 (567354612, 'Lisa Walker', 256481),
 (556784565, 'Mark Young', 205187),
 (552455348, 'Dorthy Lewis', 92013),
 (552455318, 'Larry West', 101745),
 (550156548, 'Karen Scott', 205187),
 (548977562, 'William Ward', 84476),
 (489456522, 'Linda Davis', 127984),
 (489221823, 'Richard Jackson', 23980),
 (486512566, 'David Anderson', 743001),
 (390487451, 'Lawrence Sperry', 212156),
 (356187925, 'Robert Brown', 44740)]

In [12]:
imprime_datos(BD_name)

Información base de datos: airport.db


Información tabla Flights:
	Información columna 0 - flno: INTEGER, 0, None, 0
	Información columna 1 - origin: TEXT, 0, None, 0
	Información columna 2 - destination: TEXT, 0, None, 0
	Información columna 3 - distance: INTEGER, 0, None, 0
	Información columna 4 - departs: TIME, 0, None, 0
	Información columna 5 - arrives: TIME, 0, None, 0
	Información columna 6 - price: INTEGER, 0, None, 0


Información tabla Certified:
	Información columna 0 - eid: INT, 0, None, 0
	Información columna 1 - ename: TEXT, 0, None, 0
	Información columna 2 - salary: INT, 0, None, 0
	Información columna 3 - aid: INT, 0, None, 0
	Información columna 4 - aname: TEXT, 0, None, 0
	Información columna 5 - cruisingrange: INT, 0, None, 0


Información tabla Employees:
	Información columna 0 - eid: INTEGER, 0, None, 1
	Información columna 1 - ename: TEXT, 0, None, 0
	Información columna 2 - salary: INTEGER, 0, None, 0

### Aviones

In [13]:
cursor.execute("CREATE TABLE IF NOT EXISTS Aircraft(aid INTEGER PRIMARY KEY, aname TEXT, cruisingrange INTEGER)")
cursor.execute("SELECT DISTINCT C.aid, C.aname, C.cruisingrange FROM Certified C")
for line in cursor.fetchall():
    cursor.execute('INSERT INTO Aircraft VALUES (?,?,?)', line)

In [14]:
cursor.execute("SELECT * FROM Aircraft")
cursor.fetchall()[:15]

[(1, 'Boeing 747-400', 8430),
 (2, 'Boeing 737-800', 3383),
 (3, 'Airbus A340-300', 7120),
 (4, 'British Aerospace Jetstream 41', 1502),
 (5, 'Embraer ERJ-145', 1530),
 (6, 'SAAB 340', 2128),
 (7, 'Piper Archer III', 520),
 (8, 'Tupolev 154', 4103),
 (9, 'Lockheed L1011', 6900),
 (10, 'Boeing 757-300', 4010),
 (11, 'Boeing 777-300', 6441),
 (12, 'Boeing 767-400ER', 6475),
 (13, 'Airbus A320', 2605),
 (14, 'Airbus A319', 1805),
 (15, 'Boeing 727', 1504)]

In [15]:
imprime_datos(BD_name)

Información base de datos: airport.db


Información tabla Flights:
	Información columna 0 - flno: INTEGER, 0, None, 0
	Información columna 1 - origin: TEXT, 0, None, 0
	Información columna 2 - destination: TEXT, 0, None, 0
	Información columna 3 - distance: INTEGER, 0, None, 0
	Información columna 4 - departs: TIME, 0, None, 0
	Información columna 5 - arrives: TIME, 0, None, 0
	Información columna 6 - price: INTEGER, 0, None, 0


Información tabla Certified:
	Información columna 0 - eid: INT, 0, None, 0
	Información columna 1 - ename: TEXT, 0, None, 0
	Información columna 2 - salary: INT, 0, None, 0
	Información columna 3 - aid: INT, 0, None, 0
	Información columna 4 - aname: TEXT, 0, None, 0
	Información columna 5 - cruisingrange: INT, 0, None, 0


Información tabla Employees:
	Información columna 0 - eid: INTEGER, 0, None, 1
	Información columna 1 - ename: TEXT, 0, None, 0
	Información columna 2 - salary: INTEGER, 0, None, 0


Información tabla Aircraft:
	Información columna 0 - aid: INTEGER, 0, None, 1
	Información columna 1 - aname: TEXT, 0, None, 0
	Información columna 2 - cruisingrange: INTEGER, 0, None, 0

### Relacion

In [16]:
cursor.execute("CREATE TABLE IF NOT EXISTS Relacion(eid INTEGER, aid INTEGER, PRIMARY KEY (eid,aid),\
                FOREIGN KEY(eid) REFERENCES Employees, FOREIGN KEY(aid) REFERENCES Aircraft)")
cursor.execute("SELECT C.eid, C.aid FROM Certified C\
                WHERE C.eid IS NOT NULL\
                    AND C.aid IS NOT NULL")
for line in cursor.fetchall():
    cursor.execute('INSERT INTO Relacion VALUES (?,?)', line)

In [17]:
cursor.execute("SELECT * FROM Relacion")
cursor.fetchall()[:15]

[(242518965, 2),
 (242518965, 10),
 (141582651, 2),
 (141582651, 10),
 (141582651, 12),
 (11564812, 2),
 (11564812, 10),
 (567354612, 1),
 (567354612, 2),
 (567354612, 3),
 (567354612, 4),
 (567354612, 5),
 (567354612, 7),
 (567354612, 9),
 (567354612, 10)]

In [18]:
imprime_datos(BD_name)

Información base de datos: airport.db


Información tabla Flights:
	Información columna 0 - flno: INTEGER, 0, None, 0
	Información columna 1 - origin: TEXT, 0, None, 0
	Información columna 2 - destination: TEXT, 0, None, 0
	Información columna 3 - distance: INTEGER, 0, None, 0
	Información columna 4 - departs: TIME, 0, None, 0
	Información columna 5 - arrives: TIME, 0, None, 0
	Información columna 6 - price: INTEGER, 0, None, 0


Información tabla Certified:
	Información columna 0 - eid: INT, 0, None, 0
	Información columna 1 - ename: TEXT, 0, None, 0
	Información columna 2 - salary: INT, 0, None, 0
	Información columna 3 - aid: INT, 0, None, 0
	Información columna 4 - aname: TEXT, 0, None, 0
	Información columna 5 - cruisingrange: INT, 0, None, 0


Información tabla Employees:
	Información columna 0 - eid: INTEGER, 0, None, 1
	Información columna 1 - ename: TEXT, 0, None, 0
	Información columna 2 - salary: INTEGER, 0, None, 0


Información tabla Aircraft:
	Información columna 0 - aid: INTEGER, 0, None, 1
	Información columna 1 - aname: TEXT, 0, None, 0
	Información columna 2 - cruisingrange: INTEGER, 0, None, 0


Información tabla Relacion:
	Información columna 0 - eid: INTEGER, 0, None, 1
	Información columna 1 - aid: INTEGER, 0, None, 2

Finalmente eliminamos la tabla con información repetida y cerramos la conección

In [19]:
cursor.execute("DROP TABLE IF EXISTS Certified")

In [20]:
cursor.execute("CREATE TABLE IF NOT EXISTS Certified(eid INTEGER, aid INTEGER, PRIMARY KEY (eid,aid),\
                FOREIGN KEY(eid) REFERENCES Employees, FOREIGN KEY(aid) REFERENCES Aircraft)")
cursor.execute("SELECT R.eid, R.aid FROM Relacion R")
for line in cursor.fetchall():
    cursor.execute('INSERT INTO Certified VALUES (?,?)', line)

In [21]:
cursor.execute("DROP TABLE IF EXISTS Relacion")

In [22]:
imprime_datos(BD_name)

Información base de datos: airport.db


Información tabla Flights:
	Información columna 0 - flno: INTEGER, 0, None, 0
	Información columna 1 - origin: TEXT, 0, None, 0
	Información columna 2 - destination: TEXT, 0, None, 0
	Información columna 3 - distance: INTEGER, 0, None, 0
	Información columna 4 - departs: TIME, 0, None, 0
	Información columna 5 - arrives: TIME, 0, None, 0
	Información columna 6 - price: INTEGER, 0, None, 0


Información tabla Employees:
	Información columna 0 - eid: INTEGER, 0, None, 1
	Información columna 1 - ename: TEXT, 0, None, 0
	Información columna 2 - salary: INTEGER, 0, None, 0


Información tabla Aircraft:
	Información columna 0 - aid: INTEGER, 0, None, 1
	Información columna 1 - aname: TEXT, 0, None, 0
	Información columna 2 - cruisingrange: INTEGER, 0, None, 0


Información tabla Certified:
	Información columna 0 - eid: INTEGER, 0, None, 1
	Información columna 1 - aid: INTEGER, 0, None, 2

In [23]:
connection.commit()
connection.close()

## Parte III: Resolver consultas

Considere las siguientes relaciones:
- Flights(flno: integer, origin: text, destination: text, distance: integer, departs: time, arrives: time, price: integer)
- Aircraft(aid: integer, aname: text, cruisingrange: integer)
- Employees(eid: integer, ename: text, salary: integer)
- Certified(eid, aid)

**Nota**: Considere que la relación _Employees_ describe tanto a pilotos como a otro tipo de trabajador, que cada piloto está certificado para volar al menos un avión y que solo los pilotos están certificados para volar.

En base a esto, escriba las consultas SQL para responder a las preguntas que se indican a continuación:
1. Encuentre los nombres y salarios de los pilotos certificados para volar algún avión Airbus.
1. Encuentre los nombres de los pilotos que están certificados para volar aviones con autonomía de más de 1000 millas.
1. Por cada piloto que está certificado para volar más de tres aviones, encuentre el _id_ y la autonomía del avión con máxima autonomía para el que está certificado.
1. Encuentre los nombres y salarios de todos los trabajadores que ganan más de \$50.000 y no son pilotos.
1. Encuentre los nombres de los pilotos que están certificados para volar en al menos tres aviones con autonomía de más de 1000 millas.
1. Encuentre los _id_ de los aviones que pueden ser usados en rutas de Los Ángeles a Chicago.
1. Encuentre los nombres de los pilotos cuyo sueldo es menor que el precio del vuelo más barato de Los Ángeles a Honolulu.

In [24]:
# P1. Encuentre los nombres y salarios de los pilotos certificados para volar algún avión Airbus.
connection = sqlite3.connect(BD_name) 
cursor = connection.cursor()

cursor.execute("SELECT DISTINCT E.ename, E.salary \
                FROM Employees E, Certified C, Aircraft A \
                WHERE E.eid = C.eid AND C.aid = A.aid AND A.aname LIKE '%Airbus%'")
for r in cursor:
    print(r[0])
connection.close()

Lisa Walker
Larry West
Lawrence Sperry
Betty Adams
George Wright
Mark Young
Eric Cooper

In [25]:
# P2. Encuentre los nombres de los pilotos que están certificados para volar aviones con autonomía de más de 1000 millas.

connection = sqlite3.connect(BD_name) 
cursor = connection.cursor()
cursor.execute('SELECT DISTINCT E.ename \
                FROM Employees E, Certified C, Aircraft A \
                WHERE C.aid = A.aid AND E.eid = C.eid AND A.cruisingrange > 1000')
for r in cursor:
    print(r[0])
connection.close()

James Smith
Mary Johnson
John Williams
Lisa Walker
Larry West
Karen Scott
Lawrence Sperry
Michael Miller
Robert Brown
Angela Martinez
Joseph Thompson
Betty Adams
George Wright
William Moore
Elizabeth Taylor
Mark Young
Eric Cooper
William Jones

In [26]:
# P3. Por cada piloto que está certificado para volar más de tres aviones, encuentre el id del piloto y la 
# autonomía del avión con máxima autonomía para el que está certificado.

connection = sqlite3.connect(BD_name) 
cursor = connection.cursor()
cursor.execute('SELECT C.eid, MAX (A.cruisingrange) \
                FROM Certified C, Aircraft A \
                WHERE C.aid = A.aid \
                GROUP BY C.eid \
                HAVING COUNT (*) > 3')
for r in cursor:
    print(r[0], r[1])
connection.close()

142519864 8430
269734834 8430
567354612 8430

#### Consultas anidadas

In [27]:
# P4. Encuentre los nombres y salarios de todos los trabajadores que ganan más de $50.000 y no son pilotos.

connection = sqlite3.connect(BD_name) 
cursor = connection.cursor()
cursor.execute("SELECT E.ename, E.salary \
                FROM Employees E\
                WHERE E.salary > 50000 AND E.eid NOT IN (SELECT C.eid \
                                                         FROM Certified C)")
for r in cursor:
    print(r[0],r[1])
connection.close()

David Anderson 743001
Linda Davis 127984
Dorthy Lewis 92013
Jennifer Thomas 54921

In [28]:
# P5. Encuentre los nombres de los pilotos que están certificados para volar en al menos tres aviones
# con autonomía de más de 1000 millas.
connection = sqlite3.connect(BD_name) 
cursor = connection.cursor()
cursor.execute("SELECT E.ename \
                FROM Employees E, Certified C, Aircraft A\
                WHERE E.eid = C.eid AND A.aid = C.aid AND A.cruisingrange > 1000 \
                GROUP BY C.eid \
                HAVING COUNT (*) >= 3")
for r in cursor:
    print(r[0])
connection.close()

Mary Johnson
Betty Adams
George Wright
Lawrence Sperry
Mark Young
Lisa Walker
Eric Cooper

In [29]:
# P6. Encuentre los id y nombres de los aviones que pueden ser usados en rutas de Los Ángeles a Chicago.

connection = sqlite3.connect(BD_name) 
cursor = connection.cursor()
cursor.execute("SELECT A.aid, A.aname \
                FROM Aircraft A \
                WHERE A.cruisingrange > (SELECT MIN (F.distance) \
                                         FROM Flights F \
                                         WHERE F.origin = 'Los Angeles' AND F.destination = 'Chicago')")
for r in cursor:
    print(r[0], r[1])
connection.close()

1 Boeing 747-400
2 Boeing 737-800
3 Airbus A340-300
6 SAAB 340
8 Tupolev 154
9 Lockheed L1011
10 Boeing 757-300
11 Boeing 777-300
12 Boeing 767-400ER
13 Airbus A320
14 Airbus A319

In [30]:
# P7. Encuentre los nombres de los pilotos cuyo sueldo es menor que el precio del vuelo más barato de Los Ángeles a Honolulu.

connection = sqlite3.connect(BD_name) 
cursor = connection.cursor()
cursor.execute("SELECT DISTINCT E.ename \
                FROM Employees E \
                WHERE E.salary < (SELECT MIN (F.price) \
                                  FROM Flights F \
                                  WHERE F.origin = 'Los Angeles' AND F.destination = 'Honolulu')")
for r in cursor:
    print(r[0])
connection.close()

Schwitzer 2-33
Milo Brooks